{
  "backend/main.mo": "Main backend actor defining authorization mixins, storage integration, and many public types for articles, profiles, subscriptions, journals, and related data models.",
  "feature_evidence.json": "Feature evidence report listing implemented offline bundle features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing summaries of frontend source files and their responsibilities across components and pages.",
  "frontend/DEPLOYMENT.md": "Guide outlining pre‑deployment checks and steps for promoting a reviewed frontend build to production.",
  "frontend/index.css": "Tailwind CSS entry file defining base layers, theme variables, and dark mode color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the frontend app and loading main.tsx.",
  "frontend/offline-bundle/assets/.gitkeep": "Placeholder file ensuring the assets directory is tracked in version control.",
  "frontend/offline-bundle/css/styles.css": "Standalone CSS file providing full offline site styling including layout, colors, typography, and components.",
  "frontend/offline-bundle/fonts/.gitkeep": "Placeholder file so the fonts directory remains in version control.",
  "frontend/offline-bundle/images/hero-illustration.svg": "SVG illustration used in the offline site's hero section.",
  "frontend/offline-bundle/images/journal-placeholder.svg": "SVG placeholder image representing a journal cover for the offline site.",
  "frontend/offline-bundle/images/logo.svg": "An SVG logo containing stylized plant-like paths and circles with themed colors.",
  "frontend/offline-bundle/index.html": "Static landing page HTML for Agrigence with sections for navigation, hero content, about, and forms.",
  "frontend/offline-bundle/js/app.js": "Handles mobile menu toggling, smooth scrolling, form validation, and basic UI interactions for the offline bundle.",
  "frontend/offline-bundle/README.md": "README explaining how to open and use the offline static website and showing its folder structure.",
  "frontend/src/App.tsx": "Main React app router setup defining all application routes and wrapping providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an alert message indicating insufficient permissions.",
  "frontend/src/components/CountdownTimer.tsx": "A countdown component showing time remaining until the 25th of the month.",
  "frontend/src/components/Footer.tsx": "Footer layout with submission deadline timer, contact info, social links, and visitor counter.",
  "frontend/src/components/Header.tsx": "Top navigation bar with links, search, authentication menu, and responsive mobile menu.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper including header, footer, marquee banner, and routed content outlet.",
  "frontend/src/components/LoadingScreen.tsx": "Animated loading screen supporting determinate and indeterminate progress with fade-out and SVG book animation.",
  "frontend/src/components/NoticeMarqueeBanner.tsx": "Displays a looping marquee banner of notices when enabled via configuration.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal form for capturing and saving a user's profile with validation and mutation handling.",
  "frontend/src/components/StripeSetupDialog.tsx": "Dialog for configuring Stripe by submitting secret key and allowed country codes with validation.",
  "frontend/src/components/VisitorCounter.tsx": "LocalStorage‑based visitor counter that increments on load and displays the count.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/logout handling, and persistent identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for profiles, banners, news, and other data operations.",
  "frontend/src/index.css": "Defines Tailwind layers plus extensive CSS variables for light/dark themes and adds base typography and animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders an About & Contact page with mission info, founders, and a contact form with toast-based submission feedback.",
  "frontend/src/pages/AboutPage.tsx": "Empty placeholder file for an About page.",
  "frontend/src/pages/AdminPanelContent.tsx": "Implements the full admin dashboard with CRUD operations for news, blogs, journals, editorial members, terms, and banner notices.",
  "frontend/src/pages/AdminPanelPage.tsx": "Checks admin status and conditionally renders the admin panel, loading state, or access-denied screen.",
  "frontend/src/pages/ArticleSubmissionPage.tsx": "Provides an authenticated article submission form with subscription checks and upload progress handling.",
  "frontend/src/pages/AuthorGuidelinesPage.tsx": "Displays detailed author guidelines, publication policies, and formatting requirements with SEO setup.",
  "frontend/src/pages/ContactPage.tsx": "Empty placeholder for a contact page.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the user dashboard with profile info, articles, and subscription status, handling authentication and loading states.",
  "frontend/src/pages/EditorialBoardPage.tsx": "Fetches and displays editorial board members with images, roles, and contact details using cards.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Provides a form for requesting password reset instructions, currently using a placeholder implementation.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero section, latest news, blogs, magazines, reviews, and article previews.",
  "frontend/src/pages/JournalsPage.tsx": "Shows the current journal issue and an archive filtered by year, allowing users to download journal PDFs.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login form with email/password fields, client-side validation, and placeholder authentication logic.",
  "frontend/src/pages/NewsPage.tsx": "Displays news and blog posts with tab switching, loading states, and date formatting using fetched data.",
  "frontend/src/pages/NoticeBoardPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to retry, contact support, or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment status, creates a subscription if successful, and handles loading and error states.",
  "frontend/src/pages/SignupPage.tsx": "Provides a registration form with field validation and placeholder backend logic for account creation.",
  "frontend/src/pages/SubscriptionPage.tsx": "Lists subscription plans, checks Stripe configuration, and initiates checkout sessions for authenticated users.",
  "frontend/src/pages/TermsAndConditionsPage.tsx": "React page that fetches and displays Terms and Conditions with loading skeletons and error handling.",
  "frontend/src/utils/optimizeImage.ts": "Client-side image optimizer that resizes, compresses, and optionally falls back to the original file if optimization fails or isn’t smaller.",
  "frontend/src/utils/seo.ts": "Simple utilities for setting document title and meta description.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL params, persisting them in sessionStorage, and manipulating hash-based parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, shadows, and container settings with plugins.",
  "project_state.json": "Project state snapshot describing architecture, features, and known issues of the Agrigence web app."
}