{
  "backend/main.mo": "Motoko actor managing products with admin-gated CRUD, category queries, blob storage mixin, and Stripe session/config integration.",
  "feature_evidence.json": "Feature evidence report describing files, components, and test IDs related to fixing the consultation flow errors.",
  "frontend-file-summaries.txt": "Collection of short summaries for all major frontend components, pages, and utilities in the project.",
  "frontend/deploy/nginx/site.conf": "Nginx configuration for serving the SPA with caching, security headers, and SPA fallback routing.",
  "frontend/deploy/systemd/frontend-static.service": "Systemd service unit for running Nginx as a static server for the frontend with security hardening.",
  "frontend/DEPLOYMENT.md": "Production deployment guide outlining environment setup, build verification, critical checks, and required variables.",
  "frontend/docker-compose.yml": "Docker Compose setup building and running the frontend with environment variable injection and health checks.",
  "frontend/Dockerfile": "Multi‑stage Dockerfile building the Vite React frontend with pnpm and serving it via Nginx with runtime env injection.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying base styles.",
  "frontend/index.html": "HTML entry file setting up process.env shims and loading the React app with optional runtime env overrides.",
  "frontend/LINUX_HOSTING.md": "Guide for hosting the frontend on Linux using Docker, Docker Compose, or direct Nginx deployment.",
  "frontend/nginx/default.conf": "Nginx config for serving a Vite React SPA with caching rules, security headers, and SPA fallback.",
  "frontend/offline-bundle/assets/.gitkeep": "Empty placeholder file to retain the assets directory.",
  "frontend/offline-bundle/css/styles.css": "Contains styling for the offline site including layout, colors, typography, hero section, and responsive navigation.",
  "frontend/offline-bundle/fonts/.gitkeep": "Empty placeholder file to retain the fonts directory.",
  "frontend/offline-bundle/images/hero-illustration.svg": "SVG illustration used as the hero image with landscape and agricultural elements.",
  "frontend/offline-bundle/images/journal-placeholder.svg": "SVG placeholder graphic representing a journal cover.",
  "frontend/offline-bundle/images/logo.svg": "SVG logo graphic for the Agrigence offline site.",
  "frontend/offline-bundle/index.html": "Main HTML file for the offline site defining layout, sections, navigation, and content structure.",
  "frontend/offline-bundle/js/app.js": "JavaScript for menu toggling, smooth scrolling, form handling, and section highlighting.",
  "frontend/offline-bundle/README.md": "Explains how to use the offline website bundle by opening index.html locally.",
  "frontend/project/admin.html": "Admin dashboard UI containing user search, user details view, and restricted access gate.",
  "frontend/project/assets/.gitkeep": "Placeholder file to keep the assets directory in version control.",
  "frontend/project/css/main.css": "Main stylesheet defining layout, typography, components, and theme variables for the frontend.",
  "frontend/project/dashboard.html": "User dashboard page providing profile display and editing features.",
  "frontend/project/index.html": "Login and registration interface with forms for authentication and account creation.",
  "frontend/project/js/admin.js": "Admin panel logic for loading users, viewing details, updating submissions, and handling admin actions.",
  "frontend/project/js/auth.js": "Authentication module implementing login, registration, password management, and session handling.",
  "frontend/project/js/dashboard.js": "Controls the user dashboard, loading profile, payment, and submission data and managing UI interactions like editing and photo upload.",
  "frontend/project/js/db.js": "Implements a localStorage-backed mock database with seed users, payments, submissions, and initialization logic.",
  "frontend/project/js/main.js": "Initializes page-specific logic for login, registration, and navigation based on the current page.",
  "frontend/project/README.md": "Documentation for the offline journal portal mini-app describing features, flows, accounts, and usage.",
  "frontend/project/receipts/.gitkeep": "Placeholder file ensuring the receipts directory is tracked in version control.",
  "frontend/src/App.tsx": "Configures the React router, theme, identity provider, and page routes for the frontend application.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an alert informing the user they lack permission to access a page.",
  "frontend/src/components/ArticleSubmissionPlanDetailsCard.tsx": "Shows the user's article submission plan details with loading, error, and active plan states.",
  "frontend/src/components/CountdownTimer.tsx": "Renders a live countdown timer to the monthly 25th deadline with days, hours, minutes, and seconds.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, social links, quick links, and resources sections.",
  "frontend/src/components/Header.tsx": "Implements the main site header with navigation, user menu, authentication handling, and mobile menu support.",
  "frontend/src/components/HomeHeroIllustration.tsx": "Displays a hero background that uses a video with fallback to an image based on motion preferences and errors.",
  "frontend/src/components/Layout.tsx": "Wraps the app layout with header, marquee banner, main content outlet, and footer.",
  "frontend/src/components/LoadingScreen.tsx": "Shows an animated loading screen with determinate or indeterminate progress and fade-out transitions.",
  "frontend/src/components/NoticeMarqueeBanner.tsx": "Renders a scrolling notices banner when enabled via backend configuration.",
  "frontend/src/components/ProductCard.tsx": "Displays product info with category labeling and a button linking to an external purchase page.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for collecting and submitting user profile details with validation and backend mutation.",
  "frontend/src/components/StripeSetupDialog.tsx": "Dialog component for configuring Stripe, handling secret key and country inputs with mutation and validation.",
  "frontend/src/components/VisitorCounter.tsx": "Simple visitor counter that increments and displays a value stored in localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that detects user reduced‑motion preferences using a media query.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks that wrap backend actor methods, mostly placeholders for profile, banner, news, and admin operations.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables, dark mode theming, typography rules, and utility animations.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, and the Internet Identity provider.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders an About and Contact page with mission info, founder sections, and a contact form with toast-based submission feedback.",
  "frontend/src/pages/AboutPage.tsx": "Empty file placeholder for an About page component.",
  "frontend/src/pages/AdminPanelContent.tsx": "Provides the admin interface for listing, adding, editing, and deleting products with dialogs and category handling.",
  "frontend/src/pages/AdminPanelPage.tsx": "Wraps the admin panel with permission checks and displays loading, error, or access-denied states.",
  "frontend/src/pages/ArticleSubmissionPage.tsx": "Implements article submission UI with authentication and eligibility checks but disables actual submission.",
  "frontend/src/pages/AuthorGuidelinesPage.tsx": "Displays detailed author guidelines, publication policies, and formatting requirements with SEO metadata.",
  "frontend/src/pages/ConsultationPage.tsx": "Provides a consultation request form and generates WhatsApp or email links after validating user input.",
  "frontend/src/pages/ContactPage.tsx": "Empty placeholder for a Contact page component.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the user dashboard showing profile info, subscription status, and submitted articles using various query hooks. Includes loading, error states, and status badges.",
  "frontend/src/pages/EditorialBoardPage.tsx": "Displays editorial board members with avatars, roles, and profile details using data from a query hook. Handles image URL resolution and loading states.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Shows a static page explaining that password reset is unsupported and provides support contact info. Offers navigation back to login or home.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero section and multiple content feeds such as news, blogs, magazines, reviews, books, and products, using fallback samples when needed.",
  "frontend/src/pages/JournalsPage.tsx": "Displays the current journal issue and an archive filtered by year, with downloading support via blob URLs. Includes year selection and loading handling.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login screen where email/password is disabled and only Internet Identity login is supported, including admin check and navigation after login.",
  "frontend/src/pages/NewsPage.tsx": "Displays news and blog posts with tab switching, loading states, and formatted article cards.",
  "frontend/src/pages/NoticeBoardPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a failure message for unsuccessful payments with options to retry, contact support, or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes Stripe payment success by validating session status, creating subscriptions, and showing loading or error states.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays books and agricultural products with loading, error handling, and product cards.",
  "frontend/src/pages/SignupPage.tsx": "Renders a disabled signup form and alerts users that email/password registration is unavailable and Internet Identity must be used.",
  "frontend/src/pages/SubscriptionPage.tsx": "Lists subscription plans, handles Stripe checkout session creation, and manages admin Stripe setup flow.",
  "frontend/src/pages/TermsAndConditionsPage.tsx": "React page that fetches and displays Terms and Conditions with loading and error states.",
  "frontend/src/types/process-env.d.ts": "Adds browser-safe TypeScript declarations for process.env to prevent build errors.",
  "frontend/src/utils/consultationValidation.ts": "Provides validation utilities for consultation forms including email and required‑field checks.",
  "frontend/src/utils/consultExpertMailto.ts": "Generates static or dynamic URL‑encoded mailto links for consultation requests.",
  "frontend/src/utils/consultWhatsAppLink.ts": "Builds a WhatsApp wa.me URL with encoded consultation details.",
  "frontend/src/utils/homePageSamples.ts": "Defines sample placeholder data for news, blogs, and other homepage sections.",
  "frontend/src/utils/optimizeImage.ts": "Performs client‑side image resizing/compression and provides a fallback if optimization fails.",
  "frontend/src/utils/seo.ts": "Utilities for updating document title and meta description for SEO.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Defines the project's current state, including a fix request for a consultation flow error and a pending regression-check feature."
}