{
  "backend/main.mo": "Actor defining authorization state, blob storage mixins, and many domain types for articles, profiles, subscriptions, journals, and related data models.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs with high-confidence annotations.",
  "frontend-file-summaries.txt": "Collection of short summaries describing frontend components, pages, and their functionality for reference or tooling.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining pre-deployment checks and steps for promoting a reviewed build to production.",
  "frontend/index.css": "Tailwind CSS setup defining base styles, theme variables, and light/dark mode color tokens.",
  "frontend/index.html": "Base HTML file defining root container, metadata, and script entry point for the React application.",
  "frontend/src/App.tsx": "Main application router setup using TanStack Router, registering all app routes and wrapping with providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple component displaying a destructive alert when a user lacks permission to access a page.",
  "frontend/src/components/CountdownTimer.tsx": "Countdown component calculating time remaining until the 25th of each month and rendering live-updating values.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with deadline countdown, contact info, social links, and visitor counter.",
  "frontend/src/components/Header.tsx": "Provides the main site header with navigation, search, authentication controls, and mobile menu handling.",
  "frontend/src/components/Layout.tsx": "Wraps the page structure with header, marquee banner, main content outlet, and footer.",
  "frontend/src/components/LoadingScreen.tsx": "Displays a determinate or animated loading screen with an SVG book animation and fade-out behavior.",
  "frontend/src/components/NoticeMarqueeBanner.tsx": "Shows a scrolling marquee banner of notices when enabled via backend configuration.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for collecting and submitting initial user profile information.",
  "frontend/src/components/StripeSetupDialog.tsx": "Admin dialog for configuring Stripe keys and allowed countries for payments.",
  "frontend/src/components/VisitorCounter.tsx": "Tracks and displays a local visitor count stored in localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on authentication state, invalidating related queries when refreshed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, storing identities, and exposing login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, covering profiles, news, banners, admin checks, and more.",
  "frontend/src/index.css": "Tailwind-based global stylesheet defining theme variables, dark mode, typography, and utility animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders an About & Contact page with mission info, founders, and a contact form with basic validation and toasts.",
  "frontend/src/pages/AboutPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/AdminPanelContent.tsx": "Implements the admin dashboard UI with forms and tables for managing news, blogs, articles, editorial members, terms, and banners.",
  "frontend/src/pages/AdminPanelPage.tsx": "Checks admin permissions and conditionally renders the admin panel or appropriate error or access‑denied screens.",
  "frontend/src/pages/ArticleSubmissionPage.tsx": "Handles authenticated article submission with file upload, subscription checks, and progress tracking.",
  "frontend/src/pages/AuthorGuidelinesPage.tsx": "Displays detailed author, publication, and formatting guidelines and sets page SEO metadata.",
  "frontend/src/pages/ContactPage.tsx": "Placeholder file with no implemented content.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user profile, subscription status, and article list, prompting login or profile setup when needed.",
  "frontend/src/pages/EditorialBoardPage.tsx": "Fetches and displays editorial board members with images, roles, and academic details.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Provides UI for password reset flow with placeholder logic and validation.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero section, latest news, blogs, magazines, reviews, and article previews fetched via query hooks.",
  "frontend/src/pages/JournalsPage.tsx": "Displays the current journal issue and an archive filtered by year with download support.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login form using email and password with placeholder authentication and error handling.",
  "frontend/src/pages/NewsPage.tsx": "Shows all news and blog posts in tabbed sections with loading states and formatted date display.",
  "frontend/src/pages/NoticeBoardPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays payment failure details with options to retry, contact support, or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe session status, creates a subscription on success, and handles loading and error states.",
  "frontend/src/pages/SignupPage.tsx": "Signup form page handling user input, basic validation, and a placeholder registration flow.",
  "frontend/src/pages/SubscriptionPage.tsx": "Displays subscription plans, manages Stripe checkout sessions, and handles admin configuration warnings.",
  "frontend/src/pages/TermsAndConditionsPage.tsx": "Fetches and displays Terms and Conditions content with loading and error states.",
  "frontend/src/utils/optimizeImage.ts": "Provides client-side image resizing and compression with fallback to the original file.",
  "frontend/src/utils/seo.ts": "Utility functions to set document title and meta description for SEO.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and layout options.",
  "project_state.json": "Defines the project’s schema, version, and a detailed summary of the app’s features plus an indexed list of implemented frontend and backend capabilities. Captures authentication, admin flows, content management, article submission, and supporting utilities for the Agrigence web app."
}