{
  "backend/main.mo": "Motoko canister implementing authorization, user profiles, product CRUD, and storage/Stripe mixins.",
  "feature_evidence.json": "Report listing files, components, and tests evidencing rollback feature to version v59.",
  "frontend-file-summaries.txt": "Collected summaries describing purpose of each major frontend React file.",
  "frontend/deploy/nginx/site.conf": "Example Nginx config for serving the SPA with caching, security headers, and SPA fallback routing.",
  "frontend/deploy/systemd/frontend-static.service": "Systemd unit file to run Nginx as a service for serving the frontend.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing environment setup, checks, and steps for promoting frontend builds to production.",
  "frontend/docker-compose.yml": "Docker Compose file building and running the frontend with env vars and health checks.",
  "frontend/Dockerfile": "Multi‑stage Docker build for the frontend using Node and Nginx with runtime env injection.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/index.html": "SPA entry HTML with runtime env shim and bootstrapping of the React app.",
  "frontend/LINUX_HOSTING.md": "Linux hosting guide covering Docker, Docker Compose, and direct Nginx deployment of the frontend.",
  "frontend/nginx/default.conf": "Nginx config for serving a Vite React SPA with caching rules, security headers, and SPA fallback routing.",
  "frontend/offline-bundle/assets/.gitkeep": "Empty placeholder file to keep the assets directory in version control.",
  "frontend/offline-bundle/css/styles.css": "Main stylesheet defining layout, typography, color variables, responsive header, hero section, and UI components.",
  "frontend/offline-bundle/fonts/.gitkeep": "Empty placeholder file to retain the fonts directory in version control.",
  "frontend/offline-bundle/images/hero-illustration.svg": "SVG illustration depicting a stylized agricultural landscape with hills, plants, and a tractor.",
  "frontend/offline-bundle/images/journal-placeholder.svg": "SVG placeholder image representing a journal cover with lines and decorative elements.",
  "frontend/offline-bundle/images/logo.svg": "SVG logo featuring a circular emblem with leaf-like shapes and accent elements.",
  "frontend/offline-bundle/index.html": "Main HTML file for the offline site containing header navigation, hero section, about content, and structured page layout.",
  "frontend/offline-bundle/js/app.js": "JavaScript for mobile menu toggling, smooth scrolling, basic form handling, and section-based navigation highlighting.",
  "frontend/offline-bundle/README.md": "Explains how to use the offline bundle by opening index.html directly and outlines folder structure.",
  "frontend/project/admin.html": "Admin panel UI with user search, user table, and detailed user profile display sections.",
  "frontend/project/assets/.gitkeep": "Placeholder file to retain the assets directory in version control.",
  "frontend/project/css/main.css": "Global styles for layout, typography, forms, buttons, dashboards, and responsive UI components.",
  "frontend/project/dashboard.html": "User dashboard page displaying profile information with editing and photo upload options.",
  "frontend/project/index.html": "Login and registration page with forms for authentication, account creation, and password recovery.",
  "frontend/project/js/admin.js": "Admin module that handles admin authentication, user loading, searching, detail viewing, and admin actions.",
  "frontend/project/js/auth.js": "Authentication module managing login, registration, password reset, sessions, and access control.",
  "frontend/project/js/dashboard.js": "Initializes and manages the user dashboard, handling profile display, editing, photo upload, and various section loads.",
  "frontend/project/js/db.js": "Implements a localStorage-backed mock database with seed data for users, payments, submissions, and session handling.",
  "frontend/project/js/main.js": "Determines the active page, initializes index page logic, and handles login, registration, and password flows.",
  "frontend/project/README.md": "Documentation for an offline journal management mini-app detailing authentication, user dashboard features, and admin tools.",
  "frontend/project/receipts/.gitkeep": "Placeholder file ensuring the receipts directory is committed.",
  "frontend/src/App.tsx": "Sets up the React router, query client, providers, and route definitions for all major app pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access denied alert informing users they lack permissions.",
  "frontend/src/components/ArticleSubmissionPlanDetailsCard.tsx": "Renders the user's article subscription plan details with loading, error, and active plan states.",
  "frontend/src/components/CountdownTimer.tsx": "Shows a live countdown timer to the 25th of the month deadline.",
  "frontend/src/components/Footer.tsx": "Footer component with branding, social links, navigation links, and utility widgets.",
  "frontend/src/components/Header.tsx": "Header with navigation, authentication menu, mobile menu, and admin options.",
  "frontend/src/components/HomeHeroIllustration.tsx": "Hero illustration that displays an autoplaying video with fallback to an image and a gradient overlay.",
  "frontend/src/components/Layout.tsx": "Layout wrapper composing header, notice banner, main outlet, and footer.",
  "frontend/src/components/LoadingScreen.tsx": "Animated loading screen showing determinate or timed progress with fade-out behavior.",
  "frontend/src/components/NoticeMarqueeBanner.tsx": "Scrolling notice marquee shown when enabled and loaded from banner config.",
  "frontend/src/components/ProductCard.tsx": "Product card showing product name, category badge, and external buy button.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog for collecting and submitting user profile information with validation.",
  "frontend/src/components/StripeSetupDialog.tsx": "Modal form for entering Stripe secret key and allowed countries, submitting config via mutation.",
  "frontend/src/components/VisitorCounter.tsx": "Displays a visitor count stored in localStorage and increments it on page load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and status flags.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook detecting user's reduced‑motion preference via media query.",
  "frontend/src/hooks/useQueries.ts": "Collection of placeholder and real React Query hooks for fetching and mutating backend data using an actor.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, themes, typography, and utility animations.",
  "frontend/src/main.tsx": "App entrypoint setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders an About and Contact page with mission info, founder profiles, and a basic contact form with toast-based validation.",
  "frontend/src/pages/AboutPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/AdminPanelContent.tsx": "Provides admin UI for managing products, including listing, adding, editing, and deleting items via hooks.",
  "frontend/src/pages/AdminPanelPage.tsx": "Wraps the admin panel with permission checks and displays loading or error states accordingly.",
  "frontend/src/pages/ArticleSubmissionPage.tsx": "Implements the article submission form with auth checks and eligibility validation, but disables actual submission.",
  "frontend/src/pages/AuthorGuidelinesPage.tsx": "Displays detailed author guidelines, publication policies, and formatting rules with SEO metadata setup.",
  "frontend/src/pages/ConsultationPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/ContactPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user dashboard with profile info, subscription status, and article list, handling loading and error states.",
  "frontend/src/pages/EditorialBoardPage.tsx": "Displays editorial board members with photos, roles, and contact details using fetched data and formatting helpers.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Shows a disabled password reset page explaining that password-based authentication is unsupported and providing support contact info.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero section and multiple content sections populated from queries or sample data, including news, blogs, magazines, reviews, and products.",
  "frontend/src/pages/JournalsPage.tsx": "Shows the current journal issue and an archive by year with options to download journal PDFs.",
  "frontend/src/pages/LoginPage.tsx": "Provides login via Internet Identity, with email/password fields disabled and admin check logic determining navigation.",
  "frontend/src/pages/NewsPage.tsx": "Displays all news and blog posts in tabbed sections with loading states and formatted metadata.",
  "frontend/src/pages/NoticeBoardPage.tsx": "Empty page with no implemented content.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with details and navigation options to retry, contact support, or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles Stripe payment success flow by validating session status, creating subscriptions, showing loading states, and displaying errors.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays product lists for books and agricultural items with loading and error states.",
  "frontend/src/pages/SignupPage.tsx": "Shows a disabled signup form and informs users that email/password registration is unavailable, directing them to Internet Identity instead.",
  "frontend/src/pages/SubscriptionPage.tsx": "Lists subscription plans, checks Stripe setup, and creates checkout sessions for authenticated users.",
  "frontend/src/pages/TermsAndConditionsPage.tsx": "Fetches and displays the platform’s terms and conditions with loading and error handling.",
  "frontend/src/types/process-env.d.ts": "Defines browser-safe TypeScript declarations for process.env to avoid build errors.",
  "frontend/src/utils/consultationValidation.ts": "Empty placeholder file intended for consultation-related validation logic.",
  "frontend/src/utils/consultExpertMailto.ts": "Empty placeholder utility file for generating expert consultation mailto links.",
  "frontend/src/utils/consultWhatsAppLink.ts": "Empty placeholder utility file for creating WhatsApp consultation links.",
  "frontend/src/utils/homePageSamples.ts": "Provides placeholder types and sample data for news, blog posts, and other homepage content.",
  "frontend/src/utils/optimizeImage.ts": "Implements client-side image resizing/compression and a fallback mechanism if optimization fails or yields larger output.",
  "frontend/src/utils/seo.ts": "Utility functions to set document title and meta description for SEO.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and plugin setup.",
  "project_state.json": "Tracks project state, issues, and feature requests for rolling back the app to version v59."
}