{
  "backend/main.mo": "Defines the main Motoko actor with authorization mixins, blob storage integration, and numerous domain types for articles, users, subscriptions, journals, and profiles.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short written summaries for many frontend files describing their functionality and recent updates.",
  "frontend/DEPLOYMENT.md": "Production deployment guide outlining pre-deployment checks and steps for releasing a reviewed build.",
  "frontend/index.css": "TailwindCSS setup defining root theme variables, dark mode values, and global base styles.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, query client, providers, and links all main application pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays a destructive-style alert indicating lack of permission to access a page.",
  "frontend/src/components/CountdownTimer.tsx": "Implements a live countdown timer to the 25th of each month with styled UI blocks.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a countdown timer, contact info, social links, branding, and a visitor counter.",
  "frontend/src/components/Header.tsx": "Provides the main navigation bar with search, authentication controls, responsive menus, and user/admin-specific links.",
  "frontend/src/components/Layout.tsx": "Wraps the page layout by rendering the header, routed content, and footer.",
  "frontend/src/components/LoadingScreen.tsx": "Displays a full‑screen animated loading sequence with determinate and indeterminate progress modes and fade‑out behavior.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog for collecting and submitting required user profile details using form fields and mutation hooks.",
  "frontend/src/components/StripeSetupDialog.tsx": "Dialog for admins to configure Stripe by entering the secret key and allowed country codes, with validation and status feedback.",
  "frontend/src/components/VisitorCounter.tsx": "Shows a local visitor counter stored in localStorage with an icon and animated display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity, initializing admin access and invalidating dependent queries when changed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, and clearing identities. Wraps the AuthClient with custom options and exposes status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actors, covering user profiles, news, blog posts, admin checks, and other domain data. Handles fetching, mutations, and cache invalidation for various resources.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles, theme variables, dark mode settings, typography, and utility animations. Applies consistent UI styling across the app.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering. Loads global styles and mounts App at the root element.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders an About and Contact page with mission info, founders, and a contact form using UI components and toast notifications. Handles simple form submission state locally.",
  "frontend/src/pages/AboutPage.tsx": "Empty placeholder file for an About page component.",
  "frontend/src/pages/AdminPanelContent.tsx": "Implements the admin dashboard UI with tabs and forms for managing news, blog posts, journals, editorial members, and terms placeholders. Integrates multiple data hooks and handles extensive local state for CRUD operations.",
  "frontend/src/pages/AdminPanelPage.tsx": "Checks whether the caller is an admin and conditionally renders the admin panel, a loading state, or an access denied screen. Uses useIsCallerAdmin to control access.",
  "frontend/src/pages/ArticleSubmissionPage.tsx": "Provides a form for authenticated, subscribed users to upload a PDF or DOC article with progress tracking and submit it to the backend.",
  "frontend/src/pages/AuthorGuidelinesPage.tsx": "Displays detailed manuscript formatting requirements and required sections for authors.",
  "frontend/src/pages/ContactPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user profile, subscription status, and articles, prompting login or profile setup when necessary.",
  "frontend/src/pages/EditorialBoardPage.tsx": "Fetches and displays editorial board members with photos, roles, and academic details.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Provides a form to request a password reset, with placeholder logic until backend support is implemented.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero banner, latest news, blogs, magazines, user reviews, and article previews using multiple query hooks.",
  "frontend/src/pages/JournalsPage.tsx": "Displays the current journal issue and an archive filtered by year with download support for journal PDFs.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login form with email/password fields and placeholder authentication logic pending backend integration.",
  "frontend/src/pages/NewsPage.tsx": "Shows all news and blog posts with tab-based navigation and loading states using query hooks.",
  "frontend/src/pages/NoticeBoardPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry, contact support, or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes Stripe session status, activates subscriptions, and shows success or error states based on payment verification.",
  "frontend/src/pages/SignupPage.tsx": "Signup form page handling user input, validation, and a placeholder registration action with toast feedback.",
  "frontend/src/pages/SubscriptionPage.tsx": "Displays subscription plans, handles Stripe checkout session creation, and shows status or admin setup dialogs.",
  "frontend/src/pages/TermsAndConditionsPage.tsx": "Fetches and displays Terms and Conditions content with loading and error states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and utility plugins.",
  "project_state.json": "Project metadata describing current features, versions, and system capabilities for the Agrigence app."
}