{
  "backend/main.mo": "Defines the main backend actor with authorization, blob storage mixins, and numerous types for articles, profiles, subscriptions, journals, and related data models.",
  "feature_evidence.json": "Lists implemented features with associated files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Provides concise descriptions of key frontend files, components, and pages for reference or documentation.",
  "frontend/deploy/nginx/site.conf": "Example Nginx configuration for serving the built frontend with caching, security headers, and SPA routing.",
  "frontend/deploy/systemd/frontend-static.service": "Systemd service file to run the frontend's Nginx static server with security hardening options.",
  "frontend/DEPLOYMENT.md": "Guide outlining production deployment steps, checks, and procedures for promoting a reviewed build.",
  "frontend/docker-compose.yml": "Docker Compose configuration for building and running the frontend container with health checks.",
  "frontend/Dockerfile": "Multi-stage Dockerfile that builds the frontend with pnpm and serves it via Nginx.",
  "frontend/index.css": "Tailwind CSS setup defining global theme variables, dark mode variants, and base styling.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/LINUX_HOSTING.md": "Instructions for deploying the frontend on Linux via Docker, Docker Compose, or direct Nginx hosting.",
  "frontend/nginx/default.conf": "Default Nginx config for the production frontend container, including caching, security headers, and SPA fallback.",
  "frontend/offline-bundle/assets/.gitkeep": "Placeholder file to keep the assets directory in version control.",
  "frontend/offline-bundle/css/styles.css": "Defines the layout, typography, color variables, and component styles for the offline bundle UI including header, hero section, buttons, and responsive navigation.",
  "frontend/offline-bundle/fonts/.gitkeep": "Placeholder file ensuring the fonts directory is tracked in version control.",
  "frontend/offline-bundle/images/hero-illustration.svg": "SVG illustration depicting a sunrise landscape with hills, plants, and a tractor for the hero section.",
  "frontend/offline-bundle/images/journal-placeholder.svg": "SVG placeholder graphic showing a stylized journal with lines and an emblem.",
  "frontend/offline-bundle/images/logo.svg": "SVG logo featuring a leaf-like central icon with accent shapes and circular background.",
  "frontend/offline-bundle/index.html": "Main offline landing page containing navigation, hero section, informational sections, and form placeholders for the Agrigence site.",
  "frontend/offline-bundle/js/app.js": "Handles mobile navigation toggle, smooth scrolling, demo form submissions, and section-based navigation highlighting.",
  "frontend/offline-bundle/README.md": "Instructions for using the offline static website bundle by opening index.html locally.",
  "frontend/project/admin.html": "Admin panel page structure including user management tables, profile views, payment and submission controls, and logout handling UI.",
  "frontend/project/assets/.gitkeep": "Placeholder file ensuring the assets directory is tracked in version control.",
  "frontend/project/css/main.css": "Defines global styles, color variables, layout utilities, form elements, buttons, and UI components for the app.",
  "frontend/project/dashboard.html": "Provides the user dashboard layout, including profile display/editing, photo upload controls, and linked dashboard sections.",
  "frontend/project/index.html": "Contains login and registration UI, including forms, validation fields, and navigation between auth views.",
  "frontend/project/js/admin.js": "Implements admin functionality such as authentication checks, user search, viewing/editing user details, and updating submissions.",
  "frontend/project/js/auth.js": "Handles authentication logic including login, registration, password reset, session management, and admin access checks.",
  "frontend/project/js/dashboard.js": "Manages the dashboard experience with profile viewing/editing, password changes, photo uploads, and loading user-specific data.",
  "frontend/project/js/db.js": "Provides seed data and localStorage-based database utilities for users, payments, submissions, and sessions, including admin credential migration.",
  "frontend/project/js/main.js": "Initializes page-specific logic, handling authentication redirects and login/register/forgot-password form events.",
  "frontend/project/README.md": "Documentation describing the offline journal portal features, authentication flows, admin tools, and usage instructions.",
  "frontend/project/receipts/.gitkeep": "Placeholder file to keep the receipts directory in version control.",
  "frontend/src/App.tsx": "Sets up the app’s TanStack Router routes, React Query provider, theming, and global layout for all pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays a simple alert message indicating that the user lacks permission to view the page.",
  "frontend/src/components/CountdownTimer.tsx": "Renders a live countdown to the 25th of the current or next month using a repeating timer.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a submission countdown, contact info, social links, legal link, and visitor counter.",
  "frontend/src/components/Header.tsx": "Implements the top navigation bar with links, search, authentication controls, and responsive mobile menu behavior.",
  "frontend/src/components/Layout.tsx": "Provides the global page structure including header, notice banner, routed content outlet, and footer.",
  "frontend/src/components/LoadingScreen.tsx": "A loading screen component with determinate and indeterminate progress modes, animating an SVG book and fading out when complete.",
  "frontend/src/components/NoticeMarqueeBanner.tsx": "Displays a scrolling marquee of notice messages fetched from CMS config, rendering only when enabled and populated.",
  "frontend/src/components/ProfileSetupDialog.tsx": "A dialog form that collects user profile details and submits them via a mutation, showing validation and toast messages.",
  "frontend/src/components/StripeSetupDialog.tsx": "A dialog for entering Stripe credentials and allowed countries, validating inputs and saving configuration via mutation.",
  "frontend/src/components/VisitorCounter.tsx": "Tracks and displays a local visitor count using localStorage, incrementing on each page load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identities, and exposing status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend actor functions such as profiles, banners, news, and admin checks.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for light/dark themes, base typography, and custom utility animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders an About & Contact page with mission info, founder profiles, and a contact form with validation.",
  "frontend/src/pages/AboutPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/AdminPanelContent.tsx": "Large admin dashboard component handling news, blogs, journals, editorial members, terms, and banner management with many query hooks.",
  "frontend/src/pages/AdminPanelPage.tsx": "Checks admin status and conditionally renders the admin panel, loading state, error message, or access denied screen.",
  "frontend/src/pages/ArticleSubmissionPage.tsx": "Allows authenticated, subscribed users to submit article files with upload progress and validation.",
  "frontend/src/pages/AuthorGuidelinesPage.tsx": "Displays detailed author guidelines and publication policies, setting SEO metadata on mount.",
  "frontend/src/pages/ContactPage.tsx": "Empty file with no implementation.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the user dashboard, fetching profile, articles, and subscription status, and showing profile setup if missing.",
  "frontend/src/pages/EditorialBoardPage.tsx": "Displays the editorial board list with photos, roles, and member details fetched from the backend.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Provides a form for users to request a password reset, currently using a placeholder until backend support exists.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero content and dynamically loaded news, blogs, magazines, reviews, and article previews.",
  "frontend/src/pages/JournalsPage.tsx": "Shows the current journal issue and an archive filtered by year, allowing users to download journal PDFs.",
  "frontend/src/pages/LoginPage.tsx": "Login page with email/password placeholder auth plus Internet Identity login and admin check for routing.",
  "frontend/src/pages/NewsPage.tsx": "Displays news and blog posts using tabs, fetching items from queries and rendering formatted cards.",
  "frontend/src/pages/NoticeBoardPage.tsx": "Empty page file with no implementation.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows payment failure details with options to retry, contact support, or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes Stripe session status, creates subscriptions on success, and displays loading, success, or error states.",
  "frontend/src/pages/SignupPage.tsx": "Signup form with validation and placeholder email/password registration logic.",
  "frontend/src/pages/SubscriptionPage.tsx": "Displays subscription plans, handles Stripe checkout creation, and shows Stripe setup options for admins.",
  "frontend/src/pages/TermsAndConditionsPage.tsx": "React page that fetches and displays Terms and Conditions with loading, error, and styled content states.",
  "frontend/src/utils/optimizeImage.ts": "Client-side image optimizer that resizes, compresses, and converts images with a fallback to the original file if optimization fails.",
  "frontend/src/utils/seo.ts": "Simple SEO helpers to set document title and meta description.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, container settings, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing state, features, issues, and new requests related to admin login redirection and social media link fixes."
}