{
  "backend/main.mo": "Defines the main Motoko actor with authorization mixins, blob storage, and many public types for articles, profiles, subscriptions, journals, and related domain models.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose of each frontend source file in the project.",
  "frontend/DEPLOYMENT.md": "Production deployment guide outlining pre-deployment checks and steps for promoting a reviewed build.",
  "frontend/index.css": "Global Tailwind CSS setup defining base styles, theme variables, and color tokens for light and dark modes.",
  "frontend/index.html": "Base HTML file that mounts the frontend app and loads the main TypeScript entrypoint.",
  "frontend/offline-bundle/assets/.gitkeep": "Placeholder file to keep the assets directory in version control.",
  "frontend/offline-bundle/css/styles.css": "Standalone CSS defining full styling for the offline bundle including layout, typography, header, hero, and UI components.",
  "frontend/offline-bundle/fonts/.gitkeep": "Placeholder file ensuring the fonts directory is tracked.",
  "frontend/offline-bundle/images/hero-illustration.svg": "SVG illustration used in the offline bundle's hero section.",
  "frontend/offline-bundle/images/journal-placeholder.svg": "SVG placeholder showing a stylized journal with lines and a circular emblem.",
  "frontend/offline-bundle/images/logo.svg": "SVG logo featuring a circular background, plant-like central shape, arrows, and decorative side elements.",
  "frontend/offline-bundle/index.html": "Main offline portal homepage with navigation, hero section, about content, and structured sections for the Agrigence site.",
  "frontend/offline-bundle/js/app.js": "Handles mobile menu toggling, smooth scrolling, form validation, submission alerts, and section-based nav highlighting.",
  "frontend/offline-bundle/README.md": "Instructions for using the offline bundle, explaining how to open and navigate the standalone offline site.",
  "frontend/project/admin.html": "Admin panel HTML providing user search, profile viewing, payment management, and submission management UI structures.",
  "frontend/project/assets/.gitkeep": "Empty placeholder file to retain the assets directory in version control.",
  "frontend/project/css/main.css": "Main stylesheet defining layout, typography, colors, buttons, forms, and admin/dashboard styling for the project.",
  "frontend/project/dashboard.html": "User dashboard page with profile display/editing, photo upload, payment status, and submission sections.",
  "frontend/project/index.html": "Login and registration page with forms for authentication, account creation, and password recovery navigation.",
  "frontend/project/js/admin.js": "Admin panel logic handling admin authentication, user search, viewing user details, and updating payments, passwords, and submissions.",
  "frontend/project/js/auth.js": "Authentication module providing login, registration, password reset, session handling, and access-control helpers.",
  "frontend/project/js/dashboard.js": "Dashboard logic for loading and editing user profile, managing password changes, submissions, payments, and photo uploads.",
  "frontend/project/js/db.js": "LocalStorage-backed dummy database with seed data and helper functions for users, sessions, payments, and submissions.",
  "frontend/project/js/main.js": "Initializes pages based on URL and handles login, registration, password reset, and view switching on the index page.",
  "frontend/project/README.md": "Documentation describing features, usage, accounts, and workflows of the offline journal portal mini‑app.",
  "frontend/project/receipts/.gitkeep": "Empty file used to retain the receipts directory in version control.",
  "frontend/src/App.tsx": "Sets up the React app’s routing, query client, theming, and main route tree for all pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an alert informing the user they lack permission to access the page.",
  "frontend/src/components/CountdownTimer.tsx": "Renders a live countdown to the 25th of each month and updates every second.",
  "frontend/src/components/Footer.tsx": "Shows the footer with submission deadline, contact info, social links, and a visitor counter.",
  "frontend/src/components/Header.tsx": "Provides the main navigation bar with search, authentication handling, and responsive menus.",
  "frontend/src/components/Layout.tsx": "Wraps pages with the header, marquee banner, main content area, and footer.",
  "frontend/src/components/LoadingScreen.tsx": "Displays an animated loading screen that fades out after progress completes.",
  "frontend/src/components/NoticeMarqueeBanner.tsx": "Shows a scrolling banner of notices when enabled via configuration.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Renders a user profile setup dialog with form fields and submits data via useSaveCallerUserProfile.",
  "frontend/src/components/StripeSetupDialog.tsx": "Provides a dialog to configure Stripe by submitting a secret key and allowed countries through a mutation hook.",
  "frontend/src/components/VisitorCounter.tsx": "Displays a visitor counter that increments and stores the count in localStorage on each load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook to manage login, identity state, and persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks wrapping backend actor calls for profiles, admin checks, banners, news, and other data operations.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, typography, and custom utility animations and components.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders an About and Contact page with mission info, founder details, and a contact form with toast-based submission feedback.",
  "frontend/src/pages/AboutPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/AdminPanelContent.tsx": "Implements a comprehensive admin interface for managing news, blogs, journals, editorial members, terms, and banner settings using multiple data hooks.",
  "frontend/src/pages/AdminPanelPage.tsx": "Checks admin status and conditionally renders the admin panel or access-denied and error states.",
  "frontend/src/pages/ArticleSubmissionPage.tsx": "Provides an article submission form with file upload, subscription checks, and mutation-based submission logic.",
  "frontend/src/pages/AuthorGuidelinesPage.tsx": "Displays detailed author, formatting, and publication guidelines and sets SEO metadata.",
  "frontend/src/pages/ContactPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/DashboardPage.tsx": "Shows user profile, articles, and subscription status, prompting login or profile setup when needed.",
  "frontend/src/pages/EditorialBoardPage.tsx": "Displays a grid of editorial board members fetched from the backend with profile images, roles, and contact details. Includes helper functions for image URL normalization and initials generation.",
  "frontend/src/pages/ForgotPasswordPage.tsx": "Provides a form for users to request a password reset, currently using a placeholder toast due to unimplemented backend logic. Handles validation, loading states, and success/error messages.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section and dynamically loaded news, blogs, magazines, reviews, and article previews. Includes helpers for date formatting and star rating rendering.",
  "frontend/src/pages/JournalsPage.tsx": "Shows the current journal issue and an archive filtered by year, with options to download journal PDFs. Fetches current and yearly journals and manages year selection state.",
  "frontend/src/pages/LoginPage.tsx": "Implements a login form for email/password authentication, currently using placeholder behavior until backend auth is implemented. Manages form validation, loading state, and error handling.",
  "frontend/src/pages/NewsPage.tsx": "Displays news and blog posts with tab switching, fetching data from query hooks and rendering cards with loading and empty states.",
  "frontend/src/pages/NoticeBoardPage.tsx": "File is empty and contains no implemented UI or logic.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with details and buttons to retry, contact support, or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment status, creates a subscription if successful, and displays success or error states with loading handling.",
  "frontend/src/pages/SignupPage.tsx": "Implements a signup form with validation, error handling, and placeholder logic until backend registration is implemented.",
  "frontend/src/pages/SubscriptionPage.tsx": "Fetches subscription plans, checks Stripe setup, and allows authenticated users to initiate checkout sessions for plan purchases.",
  "frontend/src/pages/TermsAndConditionsPage.tsx": "Loads and displays Terms and Conditions content with loading and error states using a styled card layout.",
  "frontend/src/utils/optimizeImage.ts": "Provides client‑side image resizing/compression via canvas and a fallback that returns the original file if optimization fails or is larger.",
  "frontend/src/utils/seo.ts": "Simple helpers to set the document title and meta description, plus a combined SEO setter.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params (including hash routing), storing them in sessionStorage, retrieving persisted values, and clearing stored parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, shadows, animations, and enabling plugins like typography, container queries, and animate.",
  "project_state.json": "Project state metadata describing architecture, features, known issues, and generated assets for the Agrigence IC web app."
}