{
  "kind": "build_request",
  "title": "Replace existing Author Guidelines page content with provided policy text (same URL, SEO-friendly)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Update the existing Author Guidelines page at the current route \"/author-guidelines\" to replace all current on-page content with the exact user-provided text (no rewriting, no paraphrasing), using proper heading hierarchy and list semantics.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Update the EXISTING page on the Agrigence website with the following content.\n\nDo NOT create a new page.\nDo NOT rewrite the text.\nReplace the current page content with the exact content below."
        ]
      },
      "acceptanceCriteria": [
        "Navigating to \"/author-guidelines\" shows an H1 with the exact text: \"Author Guidelines, Editorial & Publication Policy — Agrigence\".",
        "The introductory paragraphs and the 3 bullet points are rendered exactly as provided, preserving punctuation and curly quotes (e.g., “Popular Articles”).",
        "The \"Publication Policy\" section is an H2 followed by a single ordered list containing items 1–12 exactly as provided.",
        "The \"Formatting Guidelines\" section is an H2 followed by a single ordered list containing items 13–20 exactly as provided.",
        "The page uses semantic HTML lists (<ul>/<ol>) rather than visually simulated lists."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Preserve the site’s existing green agriculture theme, spacing, and typography on the updated Author Guidelines page, and ensure the layout is mobile responsive.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Keep the same green agriculture theme, spacing, and typography.\nUse proper heading hierarchy (H1, H2, H3), bullets, and numbered lists.\nEnsure the page is mobile responsive and SEO friendly."
        ]
      },
      "acceptanceCriteria": [
        "The page continues to use the existing container widths and vertical spacing consistent with other informational pages.",
        "On small screens, headings and lists reflow without horizontal scrolling and maintain readable line-length (no clipped text).",
        "Heading levels are used in order (single H1, H2 for main sections; no H3 unless needed for sub-sections, and if used they must appear under an H2)."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Make the updated Author Guidelines page SEO-friendly while keeping the URL unchanged: set the document title to the exact H1 text and include an appropriate meta description derived from the provided introduction; ensure the content contains the specified keywords without altering the provided text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "SEO rules:\n- Maintain proper H1, H2 structure\n- Keep URL same\n- Optimize for keywords: Author Guidelines, Agriculture Magazine, Article Submission, Editorial Board, Publication Guidelines"
        ]
      },
      "acceptanceCriteria": [
        "The route remains \"/author-guidelines\" (no new page and no route change).",
        "When visiting \"/author-guidelines\", the browser tab title/document.title equals: \"Author Guidelines, Editorial & Publication Policy — Agrigence\".",
        "A meta description tag is present for this route/page and reflects the provided introductory content without changing the on-page text.",
        "The on-page content includes the keywords naturally only where they already appear in the provided text (no extra keyword-stuffing sentences added)."
      ]
    }
  ],
  "constraints": [
    "Do not create a new page or new route; update the existing Author Guidelines page in place and keep the URL the same.",
    "Do not rewrite, paraphrase, or “improve” the user-provided text; render it verbatim.",
    "Do not modify files under frontend/src/components/ui or other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not implement the previously requested Admin CMS or email/password authentication as part of this change.",
    "Do not change backend data models or canister state for this content update."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}