{
  "kind": "build_request",
  "title": "Add a complete offline-ready static website bundle (index.html + local CSS/JS/assets) that runs by double-clicking index.html",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Create a fully offline-ready static website project bundle from scratch inside the repository, including all required files (index.html, CSS, JS, and local assets) so the site works when opening index.html directly in a browser without any server.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I don’t have existing project files.\nPlease create the complete, properly structured, offline-ready project from scratch based on my requirements, and provide all files (index.html, CSS, JS, assets structure) so I can download and use it directly"
        ]
      },
      "acceptanceCriteria": [
        "A new folder exists that contains a complete offline site with this structure:\n/project-root\n  index.html\n  /css\n  /js\n  /assets\n  /images\n  /fonts",
        "Opening the offline bundle’s index.html via double-click works in a modern browser (Chrome/Edge/Firefox) with no network access required",
        "No external (CDN) dependencies are used; all libraries, icons, and fonts referenced by the offline site are present locally and linked via relative paths",
        "No absolute paths (e.g., /css/app.css) or localhost/server URLs are used in HTML/CSS/JS; only relative paths work from the offline bundle root",
        "The offline site loads without console errors on first load"
      ]
    },
    {
      "id": "REQ-43",
      "text": "Ensure the offline static site has correct semantic HTML structure, stable CSS/JS loading order, and no duplicate/conflicting libraries within the offline bundle.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix all relative paths for CSS, JS, images, fonts, videos, and assets.\nRemove any dependency that requires a server (no localhost, no absolute paths, no CDN that breaks offline).\nIf CDN libraries are used (Bootstrap, jQuery, fonts, icons, etc.), download and link them locally.\nMerge or separate CSS/JS properly if needed for stability.\nEnsure all links, buttons, navigation, forms, and animations work without console errors.\nRemove unused code, duplicate libraries, and conflicts.\nOptimize loading order of CSS and JS.\nValidate semantic HTML structure and fix broken tags."
        ]
      },
      "acceptanceCriteria": [
        "CSS is loaded before JS in index.html, and JS is loaded in a way that does not require a server (e.g., deferred scripts)",
        "No duplicate library bundles are included in the offline bundle (e.g., multiple copies of the same framework)",
        "HTML validates structurally (no broken/unclosed tags that break layout)",
        "Navigation elements and interactive elements in the offline bundle do not throw runtime exceptions when clicked/used"
      ]
    },
    {
      "id": "REQ-44",
      "text": "Add a short, human-readable README (English) inside the offline bundle describing how to open the site offline and describing the final folder structure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "provide all files (index.html, CSS, JS, assets structure) so I can download and use it directly"
        ]
      },
      "acceptanceCriteria": [
        "README exists inside the offline bundle folder",
        "README instructions explicitly say that users can double-click index.html to run the site offline",
        "README lists or illustrates the offline bundle folder structure"
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text",
    "Do not rely on any server runtime for the offline bundle (no API calls required for core functionality)",
    "Do not use CDN links; any third-party libraries used by the offline bundle must be stored and referenced locally",
    "Do not modify files under frontend.immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui)"
  ],
  "nonGoals": [
    "Do not replace or remove the existing React + Motoko Internet Computer application",
    "Do not implement new backend (Motoko) features as part of the offline static bundle",
    "Do not add online-only integrations (analytics, external fonts via Google Fonts, external icon CDNs)"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}