{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Offline-ready static website bundle (standalone index.html with local CSS/JS/assets)",
  "requirements": [
    {
      "id": "REQ-42",
      "summary": "Create a complete standalone offline static site bundle (index.html + local CSS/JS/assets) that runs by double-clicking index.html with no server and no network.",
      "acceptanceCriteria": [
        "A new folder exists that contains a complete offline site with this structure:\n/project-root\n  index.html\n  /css\n  /js\n  /assets\n  /images\n  /fonts",
        "Opening the offline bundle’s index.html via double-click works in a modern browser (Chrome/Edge/Firefox) with no network access required",
        "No external (CDN) dependencies are used; all libraries, icons, and fonts referenced by the offline site are present locally and linked via relative paths",
        "No absolute paths (e.g., /css/app.css) or localhost/server URLs are used in HTML/CSS/JS; only relative paths work from the offline bundle root",
        "The offline site loads without console errors on first load"
      ],
      "file_operations": [
        {
          "path": "frontend/offline-bundle/index.html",
          "operation": "create",
          "description": "Create the offline bundle entrypoint HTML with semantic structure (header/nav/main/footer), and link local stylesheet and scripts via relative paths (e.g., ./css/styles.css and ./js/app.js) so it works by double-clicking without any server."
        },
        {
          "path": "frontend/offline-bundle/css/styles.css",
          "operation": "create",
          "description": "Create a self-contained stylesheet for the offline bundle using only local assets (no @import URLs) and ensuring the layout is readable and responsive without relying on any framework CDN."
        },
        {
          "path": "frontend/offline-bundle/js/app.js",
          "operation": "create",
          "description": "Create a self-contained vanilla JS file that initializes after DOM load (or via deferred script) and powers any interactive UI elements (nav toggles, accordion/faq, form validation) with defensive null-checks to avoid runtime errors."
        },
        {
          "path": "frontend/offline-bundle/assets/.gitkeep",
          "operation": "create",
          "description": "Add a placeholder file to ensure the offline bundle /assets directory exists in version control."
        },
        {
          "path": "frontend/offline-bundle/images/logo.svg",
          "operation": "create",
          "description": "Add a local logo image asset referenced from index.html using a relative path (e.g., ./images/logo.svg), ensuring no external image URLs are required."
        },
        {
          "path": "frontend/offline-bundle/images/hero-illustration.svg",
          "operation": "create",
          "description": "Add a local hero/cover image asset referenced from index.html using a relative path, ensuring the offline bundle renders a complete design without network dependencies."
        },
        {
          "path": "frontend/offline-bundle/fonts/.gitkeep",
          "operation": "create",
          "description": "Add a placeholder file to ensure the offline bundle /fonts directory exists even if the bundle uses system fonts initially (and therefore does not reference external font URLs)."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Ensure semantic HTML validity, stable CSS/JS loading order, and eliminate conflicting/duplicate libraries so offline interactions work without errors.",
      "acceptanceCriteria": [
        "CSS is loaded before JS in index.html, and JS is loaded in a way that does not require a server (e.g., deferred scripts)",
        "No duplicate library bundles are included in the offline bundle (e.g., multiple copies of the same framework)",
        "HTML validates structurally (no broken/unclosed tags that break layout)",
        "Navigation elements and interactive elements in the offline bundle do not throw runtime exceptions when clicked/used"
      ],
      "file_operations": [
        {
          "path": "frontend/offline-bundle/index.html",
          "operation": "modify",
          "description": "Ensure stable loading order (CSS in <head>, JS included with defer), semantic landmarks (<header>, <nav>, <main>, <section>, <footer>), valid markup, and only relative links to local files (no leading slashes, no external URLs, no server-only assumptions)."
        },
        {
          "path": "frontend/offline-bundle/js/app.js",
          "operation": "modify",
          "description": "Harden interactive logic so all click/submit handlers guard against missing elements, prevent default where appropriate, and avoid uncaught exceptions; keep the bundle framework-free (or, if any third-party JS is added later, ensure it is only included once and stored locally)."
        },
        {
          "path": "frontend/offline-bundle/css/styles.css",
          "operation": "modify",
          "description": "Review and adjust CSS to avoid reliance on external assets, remove unused selectors, and ensure consistent rendering without requiring additional libraries (no duplicate/conflicting stylesheets)."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Add an English README inside the offline bundle explaining offline usage (double-click index.html) and documenting the folder structure.",
      "acceptanceCriteria": [
        "README exists inside the offline bundle folder",
        "README instructions explicitly say that users can double-click index.html to run the site offline",
        "README lists or illustrates the offline bundle folder structure"
      ],
      "file_operations": [
        {
          "path": "frontend/offline-bundle/README.md",
          "operation": "create",
          "description": "Create a short English README describing how to run the site offline by double-clicking index.html, stating that no server/network is required, and documenting the final folder structure (index.html, css/, js/, assets/, images/, fonts/)."
        }
      ]
    }
  ]
}