{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update existing /author-guidelines page content, semantics, and SEO (no route changes)",
  "requirements": [
    {
      "id": "REQ-42",
      "summary": "Replace all existing /author-guidelines on-page content with the exact provided policy text, using correct heading hierarchy and semantic lists.",
      "acceptanceCriteria": [
        "Navigating to \"/author-guidelines\" shows an H1 with the exact text: \"Author Guidelines, Editorial & Publication Policy — Agrigence\".",
        "The introductory paragraphs and the 3 bullet points are rendered exactly as provided, preserving punctuation and curly quotes (e.g., “Popular Articles”).",
        "The \"Publication Policy\" section is an H2 followed by a single ordered list containing items 1–12 exactly as provided.",
        "The \"Formatting Guidelines\" section is an H2 followed by a single ordered list containing items 13–20 exactly as provided.",
        "The page uses semantic HTML lists (<ul>/<ol>) rather than visually simulated lists."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AuthorGuidelinesPage.tsx",
          "operation": "modify",
          "description": "Replace the current card-based guidelines content with the verbatim user-provided policy text for the existing /author-guidelines page, ensuring: single H1 exactly \"Author Guidelines, Editorial & Publication Policy — Agrigence\"; intro paragraphs rendered as paragraphs; the 3 intro bullets rendered as a single <ul>; \"Publication Policy\" rendered as an H2 followed by one <ol> containing items 1–12 exactly; \"Formatting Guidelines\" rendered as an H2 followed by one <ol> containing items 13–20 exactly; preserve punctuation/curly quotes exactly as provided; remove unrelated existing sections (e.g., WhatsApp help, subscription limits) if they are not part of the provided text."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Keep the existing green agriculture theme, spacing, and typography for the updated page and ensure mobile responsiveness.",
      "acceptanceCriteria": [
        "The page continues to use the existing container widths and vertical spacing consistent with other informational pages.",
        "On small screens, headings and lists reflow without horizontal scrolling and maintain readable line-length (no clipped text).",
        "Heading levels are used in order (single H1, H2 for main sections; no H3 unless needed for sub-sections, and if used they must appear under an H2)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AuthorGuidelinesPage.tsx",
          "operation": "modify",
          "description": "Apply the app’s existing layout patterns (e.g., container + max-width + vertical spacing) and existing typography classes so the updated content matches the current site theme; ensure lists and long lines wrap properly on small screens (no horizontal scrolling) and keep heading hierarchy strictly H1 then H2 (only introduce H3 if the provided text requires sub-sections under an H2)."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Make /author-guidelines SEO-friendly without changing the URL: set document title to match the H1 and provide a meta description derived from the provided introduction (without altering on-page text).",
      "acceptanceCriteria": [
        "The route remains \"/author-guidelines\" (no new page and no route change).",
        "When visiting \"/author-guidelines\", the browser tab title/document.title equals: \"Author Guidelines, Editorial & Publication Policy — Agrigence\".",
        "A meta description tag is present for this route/page and reflects the provided introductory content without changing the on-page text.",
        "The on-page content includes the keywords naturally only where they already appear in the provided text (no extra keyword-stuffing sentences added)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Ensure a base <meta name='description'> tag exists in the document <head> so the app has a description tag available for route-level updates."
        },
        {
          "path": "frontend/src/utils/seo.ts",
          "operation": "create",
          "description": "Add a small SEO utility to set document.title and to create/update the <meta name='description'> tag content at runtime for a given route (used by the Author Guidelines page)."
        },
        {
          "path": "frontend/src/pages/AuthorGuidelinesPage.tsx",
          "operation": "modify",
          "description": "Set document.title exactly to \"Author Guidelines, Editorial & Publication Policy — Agrigence\" when this page is mounted, and set the meta description content using text derived from the provided introductory paragraph(s) (e.g., reuse the first intro paragraph verbatim or a contiguous excerpt), without modifying the on-page rendered text; do not add extra keyword sentences beyond what already exists in the provided content."
        }
      ]
    }
  ]
}