{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend rollback alignment to v59 behavior",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Roll back the frontend code to match v59 behavior and ensure primary routes and Consultation actions work without runtime errors.",
      "acceptanceCriteria": [
        "Production deployment is running the v59 code (frontend bundle and backend canister WASM match v59).",
        "All primary routes load without runtime errors in the browser console (at minimum: /, /consultation, /products, /subscription, /admin).",
        "The Consultation page renders and its WhatsApp and Mail actions work as they did in v59 (no crashes; buttons enable/disable based on form validity)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Restore v59 route tree and app bootstrapping behavior for all primary routes (/, /consultation, /products, /subscription, /admin), ensuring no route-level runtime errors after rollback."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Restore v59 navigation/linking behavior (including access to /consultation, /products, /subscription, /admin) and ensure navigation actions do not trigger console/runtime errors after rollback."
        },
        {
          "path": "frontend/src/pages/ConsultationPage.tsx",
          "operation": "modify",
          "description": "Restore v59 Consultation page UI/behavior, specifically: form validity gating, button enable/disable rules, and click handlers for WhatsApp and Mail so they work without crashes and match v59 behavior."
        },
        {
          "path": "frontend/src/utils/consultationValidation.ts",
          "operation": "modify",
          "description": "Restore v59 consultation form validation semantics (required fields + email validation) to ensure the Consultation page button gating matches v59."
        },
        {
          "path": "frontend/src/utils/consultWhatsAppLink.ts",
          "operation": "modify",
          "description": "Restore v59 WhatsApp link generation logic (target phone number, message format, and URL encoding) used by the Consultation page."
        },
        {
          "path": "frontend/src/utils/consultExpertMailto.ts",
          "operation": "modify",
          "description": "Restore v59 mailto link generation logic (recipient, subject/body formatting, and URL encoding) used by the Consultation page."
        },
        {
          "path": "frontend/src/pages/ProductsPage.tsx",
          "operation": "modify",
          "description": "Restore v59 Products page rendering behavior and error/loading states to ensure /products loads without runtime errors and matches v59 UX expectations."
        },
        {
          "path": "frontend/src/pages/SubscriptionPage.tsx",
          "operation": "modify",
          "description": "Restore v59 Subscription page behavior (including any Stripe gating/visibility logic) to ensure /subscription loads without runtime errors and aligns with v59."
        },
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Restore v59 admin access gating and loading/error handling to ensure /admin loads without runtime errors and behaves as it did in v59."
        },
        {
          "path": "frontend/src/pages/AdminPanelContent.tsx",
          "operation": "modify",
          "description": "Restore v59 Admin panel content UI behavior so that the admin page renders without runtime errors and matches v59 interactions."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Update deployment/rollback notes to explicitly document how to verify the frontend artifact corresponds to v59 (build provenance and route smoke-check list including /, /consultation, /products, /subscription, /admin)."
        },
        {
          "path": "frontend/deploy/nginx/site.conf",
          "operation": "modify",
          "description": "Ensure the static hosting configuration remains compatible with v59 routing (SPA fallback) so direct navigation to /consultation, /products, /subscription, and /admin works after rollback."
        },
        {
          "path": "frontend/nginx/default.conf",
          "operation": "modify",
          "description": "Align SPA fallback and caching behavior with what was used in v59 to avoid route load failures and eliminate unexpected runtime asset loading issues after rollback."
        }
      ]
    }
  ]
}