{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin-aware Internet Identity login redirect + Agrigence footer social links",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "After Internet Identity login from /login, route admins to /admin and non-admin authenticated users to /dashboard, with safe error handling on admin-check failures.",
      "acceptanceCriteria": [
        "From the /login page, clicking the Internet Identity button completes Internet Identity authentication and then automatically routes an admin identity to /admin.",
        "From the /login page, clicking the Internet Identity button completes Internet Identity authentication and then automatically routes a non-admin identity to /dashboard.",
        "If the admin check fails (network/canister error), the UI shows an English error message and does not incorrectly route the user to /admin.",
        "The existing /admin page continues to enforce access control (non-admins see the access denied screen)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Replace the current placeholder Internet Identity button behavior with a real Internet Identity login flow using the existing useInternetIdentity hook, then use the existing admin check (useIsCallerAdmin / actor.isCallerAdmin) from the authorization component to decide the post-login redirect (/admin for admins, /dashboard for non-admin authenticated users). Add UI state to (a) prevent double-navigation, and (b) show a clear English error message if the admin check errors, ensuring the user is not routed to /admin on failure. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update footer social media icons to link to Agrigence’s real social profiles with safe new-tab attributes.",
      "acceptanceCriteria": [
        "Footer social icons are no longer \"#\" and each icon navigates to the correct Agrigence social URL listed in this requirement.",
        "Each social link uses target=\"_blank\" and rel=\"noopener noreferrer\".",
        "All user-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Replace the current placeholder (\"#\") hrefs for Facebook/Instagram/X/YouTube/LinkedIn with the provided Agrigence URLs, and ensure each anchor opens in a new tab with target=\"_blank\" and rel=\"noopener noreferrer\"."
        }
      ]
    }
  ]
}