{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 81,
  "summary": "Agrigence is an agriculture journal/publication web app built on the Internet Computer with a Motoko backend canister and a React (TanStack Router) frontend. It supports public browsing of content (home feeds, news, blog posts, journals archive, editorial board, author guidelines, terms) and an authenticated user experience via Internet Identity for profile creation, subscription purchase/activation via Stripe Checkout (IC HTTP outcalls), and research article submission (DOC/PDF) using IC blob storage. Admins (bootstrapped via an environment token + user-provided secret) can manage operational content through an admin panel: publish/delete news, CRUD blog posts (optional image blob), upload journal issues (PDF blob) and mark as current/archive, review pending article submissions (approve/reject), CRUD editorial board members (optional uploaded photo blob or static avatar URL), and manage Terms & Conditions placeholders/content.",
  "architectural_notes": [
    "Frontend uses TanStack Router for routing and @tanstack/react-query for all backend queries/mutations with cache invalidation after writes.",
    "Authentication is via DFINITY Internet Identity (AuthClient) with delegation persistence; identity is exposed through a React context hook.",
    "Backend actor creation is identity-aware (authenticated vs anonymous) and triggers access-control initialization after login.",
    "Backend authorization is role-based (admin/user/guest) using AccessControl + a Motoko mixin that bootstraps the first admin via CAFFEINE_ADMIN_TOKEN.",
    "Backend stores domain state in in-memory Map structures (profiles, subscriptions, articles, news, journals, editorial members, blog posts, etc.) with local counters for IDs.",
    "File uploads are handled as blob-storage ExternalBlob values passed from frontend to backend; frontend tracks upload progress via ExternalBlob.withUploadProgress.",
    "Stripe integration is implemented in Motoko via IC management canister http_request outcalls, using a transform function to strip headers from responses.",
    "Backend includes a blob-storage mixin for gateway principal authorization refresh, dead blob listing/pruning, and cashier cycles top-ups.",
    "Sensitive bootstrap parameters (e.g., caffeineAdminToken) are taken from the URL hash, persisted in sessionStorage, and removed from the URL.",
    "UI is built with TailwindCSS + shadcn/ui and supports light/dark themes via next-themes, plus app-wide animations (fade/slide) and a splash LoadingScreen."
  ],
  "known_issues": [
    "Email/password login, signup, and forgot-password flows are UI-only placeholders; no backend password auth/reset implementation exists.",
    "getCurrentJournal() is hardcoded to year=2024 and month=6 instead of using the isCurrent flag or current date, so the 'Current Issue' can become incorrect.",
    "Subscription lifecycle is incomplete: subscriptions are not expired/deactivated based on endDate, and article submissions do not decrement remainingArticles.",
    "getRemainingArticles() returns the count of active subscriptions rather than remainingArticles quota, producing incorrect quota information.",
    "Stripe checkout session body builder sets shipping_address_collection[allowed_countries][0] for every country, likely resulting in only one country being honored.",
    "Blog pagination endpoint returns an empty array when end index exceeds total size, instead of returning the final partial page.",
    "Blob storage cashier env var is spelled CAFFFEINE_STORAGE_CASHIER_PRINCIPAL (triple 'F'); deployments must match this exact key or storage functions will trap."
  ],
  "isFixRequest": false,
  "generatedImages": [
    {
      "filename": "frontend/public/assets/generated/agrigence-field-texture.dim_2400x1400.png",
      "description": "Dimmed field texture background used for subtle agriculture-themed section styling.",
      "targetWidth": 2400,
      "targetHeight": 1400
    },
    {
      "filename": "frontend/public/assets/generated/agrigence-leaf-pattern.dim_2400x1400.png",
      "description": "Dimmed leaf pattern background used for subtle agriculture-themed section styling.",
      "targetWidth": 2400,
      "targetHeight": 1400
    },
    {
      "filename": "frontend/public/assets/generated/agrigence-soil-texture.dim_2400x1400.png",
      "description": "Dimmed soil texture background used for subtle agriculture-themed section styling.",
      "targetWidth": 2400,
      "targetHeight": 1400
    }
  ],
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication context with persisted session",
      "synonyms": [
        "II login",
        "AuthClient",
        "InternetIdentityProvider"
      ],
      "description": "Provides a React context/hook to initialize DFINITY AuthClient, load an existing delegation from storage, login/logout, and expose identity plus granular status flags.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Identity-aware backend actor creation and query cache refresh",
      "synonyms": [
        "useActor",
        "actor bootstrapping"
      ],
      "description": "Creates an authenticated or anonymous backend actor based on the current identity, then invalidates/refetches React Query caches when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based access control with admin bootstrap secret",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "RBAC"
      ],
      "description": "Motoko RBAC where the first principal providing the correct CAFFEINE_ADMIN_TOKEN-derived secret becomes admin; other authenticated principals are registered as users. Includes admin checks and admin role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "URL hash secret parameter persistence and cleanup",
      "synonyms": [
        "getSecretParameter",
        "urlParams",
        "sessionStorage secret"
      ],
      "description": "Reads sensitive parameters from the URL hash, stores them in sessionStorage for the session, and removes them from the URL to reduce leakage; used for admin bootstrap secrets.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile save and retrieval (authenticated)",
      "synonyms": [
        "saveCallerUserProfile",
        "getCallerUserProfile"
      ],
      "description": "Authenticated users can create/update their profile (name, email, phone, qualification, occupation, institute/unlimited flags) and fetch it from the backend.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "First-time user profile setup dialog gate",
      "synonyms": [
        "ProfileSetupDialog",
        "onboarding modal"
      ],
      "description": "Shows a blocking modal on the dashboard when the user has no saved profile, collects required fields, and saves them via a backend mutation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "User dashboard for profile, subscription status, and submissions",
      "synonyms": [
        "DashboardPage",
        "My Submissions"
      ],
      "description": "Authenticated dashboard that displays stored profile info, whether the user has an active subscription, and the user's submitted articles with status badges and file metadata.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Subscription plans catalog (public)",
      "synonyms": [
        "getSubscriptionPlans",
        "plans listing"
      ],
      "description": "Backend exposes predefined subscription plans (1 article, 10 articles, unlimited, institute), and frontend renders plan cards with pricing and duration.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Stripe configuration management (admin)",
      "synonyms": [
        "StripeSetupDialog",
        "setStripeConfiguration"
      ],
      "description": "Admin can store Stripe secret key and allowed shipping countries in canister state; frontend provides an admin-only setup dialog.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Stripe Checkout session creation via IC HTTP outcalls",
      "synonyms": [
        "createCheckoutSession",
        "Stripe HTTP outcalls"
      ],
      "description": "Backend creates Stripe Checkout sessions using IC http_request outcalls; frontend builds success/cancel URLs from window origin and redirects the user to Stripe-hosted checkout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Payment verification and subscription activation flow",
      "synonyms": [
        "PaymentSuccessPage",
        "getStripeSessionStatus",
        "createSubscription"
      ],
      "description": "On return from Stripe, the frontend verifies the session status via the backend and creates a subscription for the chosen plan; includes success and failure pages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Subscription-gated article submission",
      "synonyms": [
        "hasActiveSubscription",
        "eligibility check"
      ],
      "description": "Frontend and backend enforce that only users with an active subscription can submit research articles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Research article submission with DOC/PDF upload and progress",
      "synonyms": [
        "submitArticle",
        "ExternalBlob upload"
      ],
      "description": "Users submit DOC/PDF articles with title and file metadata; files are uploaded as ExternalBlob with client-side upload progress reporting; submissions are stored as pending.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Admin review workflow for pending articles (approve/reject)",
      "synonyms": [
        "getAllPendingArticles",
        "updateArticleStatus"
      ],
      "description": "Admin panel lists pending submissions and allows approving or rejecting them, updating the author’s article record status.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Journal issue upload (PDF) and archive browsing",
      "synonyms": [
        "uploadJournal",
        "journals archive",
        "current issue"
      ],
      "description": "Admins can upload journal issues as PDF blobs with metadata and current/archive flags; public users can view a current issue section and browse/download journals by year.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "News publishing and public browsing",
      "synonyms": [
        "addNews",
        "getLatestNews",
        "deleteNews"
      ],
      "description": "Admins can publish and delete news items; public pages show latest news on the home page and a full news list on the News page.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Blog post management (CRUD) with optional image blob",
      "synonyms": [
        "addBlogPost",
        "updateBlogPost",
        "deleteBlogPost"
      ],
      "description": "Admins can create/edit/delete blog posts with title/content/author/date/short summary and optional featured image stored as a blob; public pages display latest blogs and full blog lists.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Blog listing utilities (latest, count, paginated)",
      "synonyms": [
        "getLatestBlogPosts",
        "getBlogPostCount",
        "getBlogPostsPaginated"
      ],
      "description": "Backend provides endpoints for latest blog posts, total count, and a paginated list; frontend exposes matching React Query hooks and invalidates caches on blog mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Editorial board member directory (CRUD) with blob or static avatar URL",
      "synonyms": [
        "Editorial members",
        "profilePictureUrl",
        "editorial board page"
      ],
      "description": "Admins can add/update/delete editorial members with qualifications, role, expertise, contact info, and either an uploaded blob picture or a stored profilePictureUrl; public page renders members with resolved image sources and contact links.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Seeded editorial members via canister migration",
      "synonyms": [
        "migration seeding",
        "default editorial board"
      ],
      "description": "Migration module seeds 10 default EditorialMember records (IDs 0–9) with prefilled details and static avatar URLs, and sets the editorialMemberIdCounter to 10 while retaining any existing records.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Terms & Conditions rendering with placeholder substitution and admin management",
      "synonyms": [
        "TermsPlaceholders",
        "getTermsAndConditions",
        "updateTermsAndConditions"
      ],
      "description": "Backend serves Terms & Conditions content with placeholder replacement; admins can view/update placeholder values and update the full terms content; frontend renders backend-provided text without transformations and includes loading/error states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Home page dynamic content feeds",
      "synonyms": [
        "home feeds",
        "content cards"
      ],
      "description": "Home page composes backend feeds (latest news, latest blog posts, home page magazines, article previews, and user reviews) with loading states and themed card UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "User reviews (testimonials) creation and listing",
      "synonyms": [
        "createUserReview",
        "getAllUserReviews"
      ],
      "description": "Backend allows authenticated users to create reviews (name/photoUrl/rating/feedback) and provides a public listing endpoint; frontend displays reviews on the home page.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Blob storage lifecycle and authorization utilities",
      "synonyms": [
        "caffeine storage mixin",
        "dead blob pruning",
        "gateway principals"
      ],
      "description": "Backend includes a storage mixin for updating authorized gateway principals, listing dead blobs, confirming blob deletion with forced GC, checking blob liveness, and topping up a cashier canister with cycles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "IC HTTP outcall wrapper with response transform",
      "synonyms": [
        "OutCall",
        "http_request wrapper",
        "transform()"
      ],
      "description": "Shared Motoko utilities for HTTP GET/POST outcalls with fixed cycles allocation, default headers (User-Agent, Idempotency-Key), UTF-8 body decoding, and a transform function that clears response headers.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Global layout, navigation header/footer, and utility widgets",
      "synonyms": [
        "Layout",
        "Header",
        "Footer",
        "CountdownTimer",
        "VisitorCounter"
      ],
      "description": "App layout wraps routed pages with a sticky header (navigation, search, auth/admin menu) and footer (countdown timer, contact info, Terms link, social placeholders, local visitor counter).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Animated loading splash screen",
      "synonyms": [
        "LoadingScreen",
        "preloader"
      ],
      "description": "Displays a plant-growth themed CSS animation for ~3 seconds on app start, then unmounts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Static informational pages",
      "synonyms": [
        "Author Guidelines",
        "About & Contact",
        "Terms page"
      ],
      "description": "Provides static Author Guidelines and an About & Contact page with founders/mission content and a client-side-only contact form UX (toast feedback, no backend submission).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Email/password auth UI pages (non-functional placeholders)",
      "synonyms": [
        "LoginPage",
        "SignupPage",
        "ForgotPasswordPage"
      ],
      "description": "Implements email/password login, registration, and password reset pages with validation and user guidance, but backend integration is explicitly TODO.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Production deployment runbook documentation",
      "synonyms": [
        "DEPLOYMENT.md",
        "release promotion guide"
      ],
      "description": "Includes a production deployment checklist and smoke-test steps, including explicit verification of the Terms & Conditions page content/placeholder replacement.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Reusable build-template scaffold for IC + React deployments",
      "synonyms": [
        "build-template",
        "project template",
        "deployment scaffold"
      ],
      "description": "Repository now includes a build-template directory with a full reproducible scaffold (Dockerfile, icp.yaml, deploy.sh, workspace/package configs, frontend/backend canister.yaml, shadcn/ui component set, and image pruning/resizing scripts) to standardize building and deploying the app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-32",
      "title": "GIF-based fullscreen LoadingScreen with determinate/indeterminate progress support",
      "synonyms": [
        "preloader GIF",
        "LoadingScreen progress prop"
      ],
      "description": "Updates the app preloader to render a full-screen centered GIF while preserving existing behavior: supports a determinate progress prop and an indeterminate mode that auto-completes and dismisses.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-33",
      "title": "Completed routed informational pages (About, Contact, Notice Board)",
      "synonyms": [
        "filled placeholder pages",
        "production-ready static pages"
      ],
      "description": "Replaces previously empty placeholder routed pages with coherent, production-ready content for AboutPage, ContactPage, and NoticeBoardPage so they no longer render empty screens.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-34",
      "title": "Pre-footer marketing sections with textured backgrounds (Why Choose Agrigence / What We Do)",
      "synonyms": [
        "pre-footer sections",
        "marketing card grids",
        "textured background panels"
      ],
      "description": "Adds two full-width sections above the footer—'Why Choose Agrigence' and 'What We Do'—rendered as responsive card grids (3-column desktop / 1-column mobile) with agriculture-themed icons, subtle green background textures/patterns, and soft hover/spacing styling integrated into the main layout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-35",
      "title": "Home page 'Main Objective' full-width section with subtle field texture background",
      "synonyms": [
        "Main Objective section",
        "home marketing objective panel",
        "field texture background"
      ],
      "description": "Adds a full-width 'Main Objective' section to the Home page above the footer, using a subtle low-opacity agriculture-themed field background image/texture with clean green styling, professional typography/spacing, centered heading, and responsive layout while rendering the provided text verbatim.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-36",
      "title": "Client-side SEO utility for setting page meta tags",
      "synonyms": [
        "seo.ts",
        "meta title/description utility"
      ],
      "description": "Adds a frontend utility for applying basic SEO-related document metadata (e.g., title/description and related tags) from routed pages, centralizing meta tag updates in one place.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-create-a-fully-offline-ready-static-website-project-bundle-from-scratch-inside-the-repository-including-all-required-files-index-html-css-js-and-local-assets-so-the-site-works-when-opening-index-html-directly-in-a-browser-without-any-server",
      "title": "Create a fully offline-ready static website project bundle from scratch inside the repository, including all required files (index.html, CSS, JS, and local assets) so the site works when opening index.html directly in a browser without any server.",
      "reqIds": [
        "REQ-42"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-offline-static-site-has-correct-semantic-html-structure-stable-css-js-loading-order-and-no-duplicate-conflicting-libraries-within-the-offline-bundle",
      "title": "Ensure the offline static site has correct semantic HTML structure, stable CSS/JS loading order, and no duplicate/conflicting libraries within the offline bundle.",
      "reqIds": [
        "REQ-43"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-short-human-readable-readme-english-inside-the-offline-bundle-describing-how-to-open-the-site-offline-and-describing-the-final-folder-structure",
      "title": "Add a short, human-readable README (English) inside the offline bundle describing how to open the site offline and describing the final folder structure.",
      "reqIds": [
        "REQ-44"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Full-stack code review/audit and fix any errors/bugs found (backend + frontend), including addressing existing known issues where applicable.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Fix all known issues in the project state and also implement/complete currently placeholder or unfinished functionality (e.g., email/password auth flows and other incomplete pages/features).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Use the specified plant-growing (seed/roots/shoot/leaves) minimal vector loading animation as the site preloader (ideally percentage/frame controllable via Lottie/SVG sequence).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Perform a full codebase audit and fix all errors/bugs, explicitly including all known issues listed in project_state.json for both backend and frontend.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Implement and complete currently placeholder or unfinished functionality, including the email/password login, signup, and forgot-password flows, making them functional end-to-end with Motoko backend support and React UI integration (no longer UI-only placeholders).",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Build a secure Admin Dashboard (CMS) with email/password admin authentication and a Super Admin role for full dynamic control of Agrigence website content without code changes.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Add Events/Programs management in CMS (CRUD events like conferences/trainings/workshops/seminars with images, date, venue, description, and status: upcoming/ongoing/completed).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Add CMS-managed editable page sections (homepage sections like Why Choose/What We Do/Main Objective, including editable text, images, and icons) to avoid source code edits for content changes.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "Implement a CMS Media Library for uploading/managing/reusing images, PDFs, and documents across pages and content types.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Add SEO controls in CMS (meta title/description, image alt text, and URL slug control per page/content).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "Add homepage composition controls in CMS (choose featured magazine/event/news content and allow section/content reordering).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-13",
      "summary": "Add Contact/Collaboration form submissions management in CMS (view/manage/export inquiries) with a backend persistence layer.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-14",
      "summary": "Add CMS security/performance/ops features: secure auth, fast admin UX, and backup-ready structure for CMS-managed content and media.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-15",
      "summary": "Implement secure email/password authentication for admin access, with a single \"Super Admin\" role that has full CMS permissions, and gate all admin-only backend mutations/queries behind this authorization.",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    },
    {
      "id": "AR-16",
      "summary": "Add full Magazine Management in the CMS: create, edit, delete magazine issues with PDF upload, cover image upload, title, description, and publish date; and support feature/unfeature controls for homepage display.",
      "reqIds": [
        "REQ-6"
      ],
      "status": "pending"
    },
    {
      "id": "AR-17",
      "summary": "Add Events/Programs Management to the CMS: create, edit, delete events (conference/training/workshop/seminar) with image upload, date/time (or date range), venue, description, and a status flag (upcoming/ongoing/completed).",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    },
    {
      "id": "AR-18",
      "summary": "Extend the existing News/Updates CMS so admins can edit previously published news items in addition to creating and deleting them.",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    },
    {
      "id": "AR-19",
      "summary": "Implement CMS-managed editable page sections for the homepage (including “Why Choose Agrigence”, “What We Do”, “Main Objective”, and other homepage sections currently hardcoded) so admins can update section text and associated media/icons without code changes.",
      "reqIds": [
        "REQ-9"
      ],
      "status": "pending"
    },
    {
      "id": "AR-20",
      "summary": "Add a CMS Media Library that allows Super Admin to upload, list, search/filter, view details, and delete media assets (images, PDFs, and documents), and reuse selected media across magazines, events, pages, news/blog content where applicable.",
      "reqIds": [
        "REQ-10"
      ],
      "status": "pending"
    },
    {
      "id": "AR-21",
      "summary": "Add SEO controls for CMS-managed pages and content: editable meta title, meta description, and image alt text; and allow admins to control URL slugs for relevant content types and pages where routing supports it.",
      "reqIds": [
        "REQ-11"
      ],
      "status": "pending"
    },
    {
      "id": "AR-22",
      "summary": "Implement Homepage composition controls in the CMS: choose which magazine/event/news items appear on homepage, set featured items, and support reordering of homepage sections.",
      "reqIds": [
        "REQ-12"
      ],
      "status": "pending"
    },
    {
      "id": "AR-23",
      "summary": "Persist and manage Contact/Collaboration form submissions in the backend, add an admin UI to view and manage inquiries, and support exporting inquiries to a downloadable format (e.g., CSV).",
      "reqIds": [
        "REQ-13"
      ],
      "status": "pending"
    },
    {
      "id": "AR-24",
      "summary": "Upgrade the Admin Dashboard UI into a simple, clean, non-technical CMS experience that consolidates all content controls (magazines, events, news, editorial board, pages, media library, SEO, homepage, inquiries) into an intuitive navigation structure.",
      "reqIds": [
        "REQ-14"
      ],
      "status": "pending"
    },
    {
      "id": "AR-25",
      "summary": "Add CMS operational safety features: provide an admin-only export of CMS-managed data (content + configuration metadata) to a structured JSON format suitable for backup and restore, and ensure admin pages load quickly using React Query caching and incremental loading states.",
      "reqIds": [
        "REQ-15"
      ],
      "status": "pending"
    },
    {
      "id": "AR-26",
      "summary": "Implement secure email/password authentication for Admin CMS access, supporting a single \"Super Admin\" role with full permissions, and ensure all admin-only backend operations are gated behind Super Admin authorization (not just frontend route gating).",
      "reqIds": [
        "REQ-16"
      ],
      "status": "pending"
    },
    {
      "id": "AR-27",
      "summary": "Add backend support for Super Admin credential management and secure password handling, including: initial Super Admin bootstrap flow, password hashing (no plaintext storage), and basic brute-force protections suitable for a single-admin CMS (e.g., rate limiting / cooldown on failed logins).",
      "reqIds": [
        "REQ-17"
      ],
      "status": "pending"
    },
    {
      "id": "AR-28",
      "summary": "Upgrade the existing Admin Panel UI into a simple, clean, non-technical CMS experience with clear navigation for: Magazines, Events/Programs, News/Updates, Editorial Board, Pages, Media Library, SEO, Homepage, and Inquiries.",
      "reqIds": [
        "REQ-18"
      ],
      "status": "pending"
    },
    {
      "id": "AR-29",
      "summary": "Implement full Magazine Management in the CMS: create, edit, delete magazine issues with PDF upload plus cover image upload, title, description, and publish date; and add a feature/unfeature control to select issues for homepage display.",
      "reqIds": [
        "REQ-19"
      ],
      "status": "pending"
    },
    {
      "id": "AR-30",
      "summary": "Add Events/Programs Management with full CRUD for conferences/trainings/workshops/seminars, including event image upload, date (or date range), venue, description, and a status flag (upcoming/ongoing/completed).",
      "reqIds": [
        "REQ-20"
      ],
      "status": "pending"
    },
    {
      "id": "AR-31",
      "summary": "Extend News/Updates CMS capabilities so admins can edit previously published news items (in addition to creating and deleting them).",
      "reqIds": [
        "REQ-21"
      ],
      "status": "pending"
    },
    {
      "id": "AR-32",
      "summary": "Extend Editorial Board Management to include the requested member fields: photo upload, name, designation, bio, and social links (store and render them on the public Editorial Board page).",
      "reqIds": [
        "REQ-22"
      ],
      "status": "pending"
    },
    {
      "id": "AR-33",
      "summary": "Implement CMS-managed editable homepage sections so admins can update homepage content (e.g., “Why Choose Agrigence”, “What We Do”, “Main Objective”, and other homepage sections currently hardcoded), including editable text plus associated images/icons, without modifying source code.",
      "reqIds": [
        "REQ-23"
      ],
      "status": "pending"
    },
    {
      "id": "AR-34",
      "summary": "Implement a CMS Media Library that allows Super Admin to upload, list, search/filter, view details, and delete media assets (images, PDFs, documents), and reuse selected media across magazines, events, pages, and other CMS-managed content types.",
      "reqIds": [
        "REQ-24"
      ],
      "status": "pending"
    },
    {
      "id": "AR-35",
      "summary": "Add SEO controls editable in the CMS: meta title and meta description for key pages (at minimum: Home, News, Journals, Editorial Board, Terms) and alt text for CMS-managed images; also allow admins to control URL slugs where routing supports it.",
      "reqIds": [
        "REQ-25"
      ],
      "status": "pending"
    },
    {
      "id": "AR-36",
      "summary": "Implement homepage composition controls in the CMS: choose which magazine/event/news items appear on the homepage and allow reordering of homepage sections (within the set of CMS-managed sections).",
      "reqIds": [
        "REQ-26"
      ],
      "status": "pending"
    },
    {
      "id": "AR-37",
      "summary": "Persist and manage Contact/Collaboration form submissions in the backend, provide an admin UI to view/manage inquiries, and support exporting inquiries to a downloadable format (CSV or JSON).",
      "reqIds": [
        "REQ-27"
      ],
      "status": "pending"
    },
    {
      "id": "AR-38",
      "summary": "Add CMS operational safety features: provide an admin-only export of CMS-managed data (content + configuration metadata + media library metadata) to a structured JSON format suitable for backup/restore, and ensure CMS pages load quickly via React Query caching and incremental loading states.",
      "reqIds": [
        "REQ-28"
      ],
      "status": "pending"
    },
    {
      "id": "AR-39",
      "summary": "Implement a secure email/password Admin authentication system for the CMS, including a single \"Super Admin\" role, an initial bootstrap flow, secure password hashing (no plaintext storage), and basic brute-force protection (e.g., cooldown/rate limit after failed attempts).",
      "reqIds": [
        "REQ-29"
      ],
      "status": "pending"
    },
    {
      "id": "AR-40",
      "summary": "Add a dedicated Admin CMS login UI for email/password and gate the Admin CMS routes behind the authenticated Super Admin session, with clear error messages and a non-technical UX.",
      "reqIds": [
        "REQ-30"
      ],
      "status": "pending"
    },
    {
      "id": "AR-41",
      "summary": "Implement full CRUD for \"Magazine Issues\" managed via the CMS, supporting PDF upload, cover image upload, title, description, and published date, without requiring any code changes for content updates.",
      "reqIds": [
        "REQ-31"
      ],
      "status": "pending"
    },
    {
      "id": "AR-42",
      "summary": "Implement full CRUD for \"Events\" in the CMS, supporting event type (conference/training/workshop/seminar), image, date/time (or date range), venue, description, and status (upcoming/ongoing/completed).",
      "reqIds": [
        "REQ-32"
      ],
      "status": "pending"
    },
    {
      "id": "AR-43",
      "summary": "Extend the existing News/Updates CMS so admins can edit previously published news items, not only create and delete them.",
      "reqIds": [
        "REQ-33"
      ],
      "status": "pending"
    },
    {
      "id": "AR-44",
      "summary": "Extend Editorial Board management to match the requested CMS fields: photo, name, bio, and role (and keep existing fields where applicable).",
      "reqIds": [
        "REQ-34"
      ],
      "status": "pending"
    },
    {
      "id": "AR-45",
      "summary": "Implement CMS-managed editable homepage sections for: \"Why Choose Agrigence\", \"What We Do\", and \"Main Objective\", including editable text and associated images/icons, so these sections are no longer hardcoded in the frontend.",
      "reqIds": [
        "REQ-35"
      ],
      "status": "pending"
    },
    {
      "id": "AR-46",
      "summary": "Implement a CMS Media Library for uploading and managing images and files (at minimum: images + PDFs), including listing, searching/filtering, viewing asset details (filename, type, size), editing alt text, and deleting assets.",
      "reqIds": [
        "REQ-36"
      ],
      "status": "pending"
    },
    {
      "id": "AR-47",
      "summary": "Add CMS controls that determine which content appears on the homepage (e.g., selecting featured magazine issues, featured events, and featured news) and support simple reordering of homepage sections.",
      "reqIds": [
        "REQ-37"
      ],
      "status": "pending"
    },
    {
      "id": "AR-48",
      "summary": "Implement CMS-managed SEO settings: meta title and meta description for key pages, and ensure media alt text is used consistently for CMS-managed images.",
      "reqIds": [
        "REQ-38"
      ],
      "status": "pending"
    },
    {
      "id": "AR-49",
      "summary": "Persist and manage Contact/Collaboration form submissions: store submissions in the backend, show a CMS inbox to view/search submissions, allow marking as resolved/archived, and allow exporting submissions to a downloadable format (CSV or JSON).",
      "reqIds": [
        "REQ-39"
      ],
      "status": "pending"
    },
    {
      "id": "AR-50",
      "summary": "Consolidate and simplify the existing Admin panel experience into a non-technical CMS navigation structure that includes: Magazines, Events, News/Updates, Editorial Board, Pages (homepage sections), Media Library, SEO, Homepage, and Inquiries.",
      "reqIds": [
        "REQ-40"
      ],
      "status": "pending"
    },
    {
      "id": "AR-51",
      "summary": "Add an admin-only data export endpoint for CMS-managed content and configuration (magazines, events, homepage sections/composition, media metadata, SEO settings, inquiries) to support backup/restore workflows.",
      "reqIds": [
        "REQ-41"
      ],
      "status": "pending"
    },
    {
      "id": "AR-52",
      "summary": "Create a complete offline-ready static website project from scratch (index.html + local CSS/JS + local assets/fonts/libs), with clean folder structure and no server/CDN dependencies, so double-clicking index.html works without broken links or console errors.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Agrigence",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}